/*
 * @lc app=leetcode.cn id=1679 lang=javascript
 *
 * [1679] K 和数对的最大数目
 */

// @lc code=start
/**
 * 哈希表解法：时间复杂度 O(n)
 * 自己在做这个题的时候，半天没有理顺，还是看了题解发现这个很简单的思路的。所以就是说不太会还是及时参考别人的思路，别自己浪费时间
 * 思路：维护一张map表，从头遍历数组，如果当前元素 c 在map中找不到对应的 k - c，就把当前 c 存到map中，注意维护一下数量。
 * 如果能找到，那就count + 1，并且把k - c 在map中删掉一个。
 * 自己的理解：因为是需要找到两个数之和为k，并且不止一对，所以当你在遍历数组的某个数的时候，有可能就会存在另一个数在后面，如果遍历后面的数的时候也有可能存在一个数在前面。
 * 所以如果当前数的另一半在map中找不到就可以先缓存起来，这样时间负责度就会比较低。
 * @param {number[]} nums
 * @param {number} k
 * @return {number}
 */
var maxOperations = function(nums, k) {
    const map = new Map()
    let count = 0
    for(let i = 0; i < nums.length; i ++) {
      const c = nums[i]
      const find = k - c
      // 如果能找到另一半，就删掉map中缓存的数，并且count ++
      if(map.has(find)) {
        count ++
        if(map.get(find) > 1) {
          map.set(find, map.get(find) - 1)
        } else {
          map.delete(find)
        }
      } else {
        // 如果找不到就先缓存，这是为了保证遍历过的数能 O(1) 的找到
        map.set(c, (map.get(c) || 0) + 1)
      }
    }
    return count
};


/**
 * 双指针解法：时间复杂度 O(n log n)
 * 思路：先排序，后查找。left，right分别指向开头和结尾。如果大于k，移动右边的，让值减小。
 * 为什么不是左指针左移？因为我们遍历的方向就是从外向内缩小，也就是外层的都是被我们所排除掉的数，所以指针只能继续向内查找
 * @param {number[]} nums
 * @param {number} k
 * @return {number}
 */
var maxOperations2 = function(nums, k) {
    nums.sort((a, b) => a - b)
    let left = 0, right = nums.length - 1
    let count = 0
    while(left < right) {
      const sum  = nums[left] + nums[right]
      // 如果大于k，移动右边的，让值减小
      if(sum > k) {
        right --
        // 如果小于k，移动左边的，让值增大
      } else if (sum < k) {
        left ++
      } else {
        count ++
        left ++
        right --
      }
    }
    return count
};

// @lc code=end
console.log(maxOperations2([63,10,28,31,90,53,75,77,72,47,45,6,49,13,77,61,68,43,33,1,14,62,55,55,38,54,8,79,89,14,50,68,85,12,42,57,4,67,75,6,71,8,61,26,11,20,22,3,70,52,82,70,67,18,66,79,84,51,78,23,19,84,46,61,63,73,80,61,15,12,58,3,21,66,42,55,7,58,85,60,23,69,41,61,35,64,58,84,61,77,45,14,1,38,4,8,42,16,79,60,80,39,67,10,24,15,6,37,68,76,30,53,63,87,11,71,86,82,77,76,37,21,85,7,75,83,80,8,19,25,11,10,41,66,70,14,23,74,33,76,35,89,68,85,83,57,6,72,34,21,57,72,79,29,65,3,67,8,24,24,18,26,27,68,78,64,57,55,68,28,9,11,38,45,61,37,81,89,38,43,45,26,84,62,22,37,51,15,30,67,75,24,66,40,81,74,48,43,78,14,33,19,73,5,1,2,53,29,49,73,23,5], 59))
